Revit 2027 API
FabricationPartBrowserChangedEventArgs.GetCurrentSolutionPartTypeIds Method
 Returns set of fabrication part types that are used in the currently selected solution.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetCurrentSolutionPartTypeIds()
Public Function GetCurrentSolutionPartTypeIds As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetCurrentSolutionPartTypeIds()
member GetCurrentSolutionPartTypeIds : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 The set of ElementIds.
See Also
Reference
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace